In [5]:
import pandas as pd

source = pd.DataFrame({
    'CPF'  : ['99999870015','99999870015', '99999870015', '01595449043','01595449043'], 
    'Cat'  : ['SILKADA UNISSEX', 'MARIO','SUPER', 'TRADICIONAL', 'SILKADA UNISSEX'],
    'Qtde' : [3,3,3,12,1]})

source

           CPF              Cat  Qtde
0  99999870015  SILKADA UNISSEX     3
1  99999870015            MARIO     3
2  99999870015            SUPER     3
3  01595449043      TRADICIONAL    12
4  01595449043  SILKADA UNISSEX     1

In [6]:
source.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   CPF     5 non-null      object
 1   Cat     5 non-null      object
 2   Qtde    5 non-null      int64
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes

In [7]:
forma1 = source.groupby(['CPF','Qtde'])['Cat'].agg(pd.Series.mode).reset_index()
forma1

           CPF  Qtde                              Cat
0  01595449043     1                  SILKADA UNISSEX
1  01595449043    12                      TRADICIONAL
2  99999870015     3  [MARIO, SILKADA UNISSEX, SUPER]

In [8]:
forma2 = forma1.sort_values('Qtde', ascending=False).drop_duplicates('CPF').sort_index().reset_index()
forma2

   index          CPF  Qtde                              Cat
0      1  01595449043    12                      TRADICIONAL
1      2  99999870015     3  [MARIO, SILKADA UNISSEX, SUPER]

In [13]:
import pandas as pd
data_values = [['aggc', 23124, 37, 201610, -15.42, -32.11],
               ['aggc', 23124, 19, 201611, -15.42, -32.11],
               [' abc', 231, 22, 201610, -26.42, -43.11],
               [' abc', 231, 22, 201611, -26.42, -43.11],
               [' ttx', 231, 10, 201610, -22.42, -46.11],
               [' ttx', 231, 10, 201611, -22.42, -46.11],
               [' tty', 231, 25, 201610, -25.42, -42.11],
               [' tty', 231, 45, 201611, -25.42, -42.11],
               ['xptx', 124, 62, 201611, -26.43, -43.21],
               ['xptx', 124, 260, 201610, -26.43, -43.21],
               ['xptx', 23124, 50, 201610, -26.43, -43.21],
               ['xptx', 23124, 50, 201611, -26.43, -43.21]]
data_cols = ['cod', 'name', 'sum_vol', 'date', 'lat', 'lon']
df = pd.DataFrame(data_values, columns=data_cols)
df

     cod   name  sum_vol    date    lat    lon
0   aggc  23124       37  201610 -15.42 -32.11
1   aggc  23124       19  201611 -15.42 -32.11
2    abc    231       22  201610 -26.42 -43.11
3    abc    231       22  201611 -26.42 -43.11
4    ttx    231       10  201610 -22.42 -46.11
5    ttx    231       10  201611 -22.42 -46.11
6    tty    231       25  201610 -25.42 -42.11
7    tty    231       45  201611 -25.42 -42.11
8   xptx    124       62  201611 -26.43 -43.21
9   xptx    124      260  201610 -26.43 -43.21
10  xptx  23124       50  201610 -26.43 -43.21
11  xptx  23124       50  201611 -26.43 -43.21

In [14]:
def top_value_count(x, n=5):
    return x.value_counts().head(n)

gb = df.groupby(['name', 'date']).cod
df_top_freq = gb.apply(top_value_count).reset_index()
df_top_freq.rename(columns=dict(level_2='cod', cod='count_cod'))

     name    date   cod  count_cod
0     124  201610  xptx          1
1     124  201611  xptx          1
2     231  201610   tty          1
3     231  201610   abc          1
4     231  201610   ttx          1
5     231  201611   tty          1
6     231  201611   abc          1
7     231  201611   ttx          1
8   23124  201610  aggc          1
9   23124  201610  xptx          1
10  23124  201611  aggc          1
11  23124  201611  xptx          1

In [ ]:
df[df['nr_cpf']=="30738332852"].sort_values("qt_items_",ascending=False).head()
forma2[forma2['nr_cpf']=="30738332852"].head()


# forma2[forma2['nm_subcategoria_produto'].str.contains(",")]
df[df['nr_cpf']=="00000274640"].sort_values("qt_items_",ascending=False).head()


forma2[forma2['nr_cpf']=="00000274640"].head()

In [2]:
posicao_titulo = 153.5233139032815
effective_page_width = 276.9975833333333
pdf_r_margin = 10.001249999999999
effective_page_width/1.93 + pdf_r_margin

153.5233139032815